{"stock_news": {"apple": [{"title": "Apple says it’ll use Apple Maps Look Around photos to train AI", "description": "Sometime earlier this month, Apple updated a section of its website that discloses how it collects and uses imagery for Apple Maps’ Look Around feature, which is similar to Google Maps’ Street View, as spotted by 9to5Mac. A newly added paragraph reveals that,…", "content": "Starting in March 2025, Apple will use blurred imagery captured during Apple Maps surveys to improve other services.\r\nStarting in March 2025, Apple will use blurred imagery captured during Apple Maps… [+1511 chars]", "res": "POSITIVE", "score": 0.5733867883682251, "updateddate": "2025-04-03"}], "amazon": [{"title": "FTC Removes Posts Critical of Amazon, Microsoft, and AI Companies", "description": "Business-guidance content published during the Biden administration has been removed from the Federal Trade Commission website.", "content": "The Trump administrations Federal Trade Commission has removed four years worth of business guidance blogs as of Tuesday morning, including important consumer protection information related to artifi… [+4436 chars]", "res": "NEGATIVE", "score": 0.9990273714065552, "updateddate": "2025-04-03"}], "meta": [{"title": "Meta Tries to Bury a Tell-All Book", "description": "Mark Zuckerberg might be in his post-fact-checking-era. But that hasn’t stopped Meta from going after the author of Careless People.", "content": "It was Meta itself that first told me about the new book attacking Mark Zuckerberg, Sheryl Sandberg, and the allegedly bankrupt morals of their company. On March 7, a Meta PR person contacted me to a… [+5330 chars]", "res": "POSITIVE", "score": 0.985862135887146, "updateddate": "2025-04-03"}], "microsoft": [{"title": "FTC Removes Posts Critical of Amazon, Microsoft, and AI Companies", "description": "Business-guidance content published during the Biden administration has been removed from the Federal Trade Commission website.", "content": "The Trump administrations Federal Trade Commission has removed four years worth of business guidance blogs as of Tuesday morning, including important consumer protection information related to artifi… [+4436 chars]", "res": "NEGATIVE", "score": 0.9990273714065552, "updateddate": "2025-04-03"}], "nvidia": [{"title": "GM taps Nvidia to boost its embattled self-driving projects", "description": "At Nvidia’s annual GTC conference in San Jose, Calif. today, the chipmaker announced it was teaming up with General Motors to develop next-generation cars, robots, and factories.  GM says it will apply several of Nvidia’s products to its business, such as the…", "content": "The automaker will use the deep-pocketed tech giants chips and software to develop next-gen autonomous cars, robots, and manufacturing processes.\r\nThe automaker will use the deep-pocketed tech giants… [+3825 chars]", "res": "POSITIVE", "score": 0.9953085780143738, "updateddate": "2025-04-03"}], "tesla": [{"title": "Is Tesla cooked?", "description": "Tesla stock plunged 15 percent on Monday, its steepest drop in five years. The price is down over 50 percent since its December highs. Tesla owners, disgusted with Elon Muskâ\u0080\u0099s slash-and-burn tactics for the Trump administration, are selling their vehicles a…", "content": "The CEO is absent, the stocks are plummeting, and the brand is toxic. Teslas future looks grim. \r\nThe CEO is absent, the stocks are plummeting, and the brand is toxic. Teslas future looks grim. \r\nTes… [+10200 chars]", "res": "NEGATIVE", "score": 0.9994163513183594, "updateddate": "2025-04-03"}], "google": [{"title": "Google is fixing outdated Pixel weather forecasts", "description": "Some Google Pixel users have found that their At a Glance widget has been showing outdated weather forecasts, as reported by Android Police. But the company says in a statement to The Verge that it’s addressing the issue. According to one user on Reddit who h…", "content": "If your At a Glance widget was showing old forecasts, you werent alone.\r\nIf your At a Glance widget was showing old forecasts, you werent alone.\r\nSome Google Pixel users have found that their At a Gl… [+913 chars]", "res": "NEGATIVE", "score": 0.9976758360862732, "updateddate": "2025-04-03"}]}}